src/test/resources/jsonResponses/creditOperations/discountedCreditRights/contractInstallments/invoiceFinancingContractInstallmentsResponse(WrongMaxLength).json

{
    "data": {
        "typeNumberOfInstalments": "MES",
        "totalNumberOfInstalments": 130632,
        "typeContractRemaining": "DIA",
        "contractRemainingNumber": 14600,
        "paidInstalments": 7334,
        "dueInstalments": 57,
        "pastDueInstalments": 73,
        "balloonPayments": [
            {
                "dueDate": "2021-05-21",
                "currency": "BRL",
                "amount": 100000.04
            }
        ]
    },
    "links": {
        "self": "https://api.banco.com.br/open-banking/api/v1/resource",
        "first": "https://api.banco.com.br/open-banking/api/v1/resource",
        "prev": "https://api.banco.com.br/open-banking/api/v1/resource",
        "next": "https://api.banco.com.br/open-banking/api/v1/resource",
        "last": "https://api.banco.com.br/open-banking/api/v1/resource"
    },
    "meta": {
        "totalRecords": 1,
        "totalPages": 1,
        "requestDateTime": "2021-05-21T08:30:00Z"
    }
}
